src/DataProcessors/ВыборИзСписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ВыборИзСписка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МассивВыбора</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаВыбора</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественныйПодбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивПомеченных</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодстрокаПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ВыборИзСписка/Forms/Кнопки0/module.bsl
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ФормаВыбора = ЭтаФорма;
	
	ЗаполнитьТаблицуВыбора();
	ВывестиТекущуюСтраницу();
	
	Заголовок = ЗаголовокФормы;
	// поиск нужен только если много страниц
	Если ВсегоСтраниц=1 Тогда
		//ЭлементыФормы.ПанельФильтр.Свертка = РежимСверткиЭлементаУправления.Верх;
		//ЭтаФорма.Высота = ЭтаФорма.Высота - ЭлементыФормы.ПанельФильтр.Высота;
	КонецЕсли; 
	
	Если МножественныйПодбор Тогда
		// кнопка ОК нужна, стрелки посередине
		ЭлементыФормы.КнопкаОК.Видимость = Истина;
		ЭлементыФормы.ПанельСтрелки.Лево = ЭтаФорма.Ширина/2 - ЭлементыФормы.ПанельСтрелки.Ширина/2;
	Иначе
		// кнопка ОК не нужна, стрелки прижимаем к правому краю
		ЭлементыФормы.КнопкаОК.Видимость = Ложь;
		ЭлементыФормы.ПанельСтрелки.Лево = ЭтаФорма.Ширина - ЭлементыФормы.ПанельСтрелки.Ширина - 4;
	КонецЕсли; 
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
			
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
	РаботаСокнами.CloseScreenKey();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаСтрелкаВверхНажатие(Элемент)
	
	ТекСтраница = Макс(1, ТекСтраница - 1);
	ВывестиТекущуюСтраницу();
	
КонецПроцедуры

Процедура КнопкаСтрелкаВнизНажатие(Элемент)
	
	ТекСтраница = Мин(ВсегоСтраниц, ТекСтраница + 1);
	ВывестиТекущуюСтраницу();
	
КонецПроцедуры

Процедура КнопкаВыбораНажатие(Элемент)
	
	ИндексЗначенияПервойКнопки = (ТекСтраница-1) * КолвоКнопок;
	НомерКнопки = Число(Сред(Элемент.Имя,7));
	
	Попытка
		ЗначениеВыбора = ТаблицаВыбора[ИндексЗначенияПервойКнопки + НомерКнопки-1].Значение;
	Исключение
		ЗначениеВыбора = МассивВыбора[ИндексЗначенияПервойКнопки + НомерКнопки-1];
	КонецПопытки;
	
	ОбработкаВыбораЗначения( ЗначениеВыбора );
	
	Если МножественныйПодбор Тогда
		Элемент.Картинка = ?(МассивПомеченных.Найти(ЗначениеВыбора)=Неопределено, Новый Картинка, БиблиотекаКартинок.Галка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОК(Элемент)
	
	Закрыть(МассивПомеченных);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Работа с фильтром

Процедура КнопкаЭкраннаяКлаваНажатие(Элемент)
	
	ИнтерфейсРМ.ЭкраннаяКлавиатура();
	
	ТекущийЭлемент = ЭлементыФормы.ПодстрокаПоиска;
	
КонецПроцедуры

Процедура ПодстрокаПоискаАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПолучитьРезультатЗапросаАвтоподбора(Текст);
	
КонецПроцедуры

Процедура ПодстрокаПоискаОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Значение = Текст;
	
	ПолучитьРезультатЗапросаАвтоподбора(Текст);
	
КонецПроцедуры

Процедура КнопкаОчиститьФильтрНажатие(Элемент)
	
	ОчиститьФильтр();
	
	ТекущийЭлемент = ЭлементыФормы.ПодстрокаПоиска;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

КолвоКнопок = 12;
